PRAK701/app/Controllers/Buku.php

SELECT *
FROM `buku`
---
    public function index() {
        $model = new BukuModel();
        $data['buku'] = $model->findAll();