PRAK701/app/Controllers/Member.php

SELECT *
FROM `member`
---
    public function index() {
        $model = new MemberModel();
        $data['member'] = $model->findAll();