PRAK701/app/Controllers/Peminjaman.php

SELECT *
FROM `member`
SELECT *
FROM `buku`
---
    public function create() {
        $data['members'] = (new MemberModel())->findAll();
        $data['buku'] = (new BukuModel())->findAll();