PRAK701/app/Models/PeminjamanModel.php

    public function withRelations() {
        return $this->select('peminjaman.*, member.nama as member, buku.judul as buku')
                    ->join('member', 'member.id = peminjaman.member_id')
                    ->join('buku', 'buku.id = peminjaman.buku_id')
                    ->findAll();
---
SELECT `peminjaman`.*, `member`.`nama` as `member`, `buku`.`judul` as `buku`
FROM `peminjaman`
JOIN `member` ON `member`.`id` = `peminjaman`.`member_id`
JOIN `buku` ON `buku`.`id` = `peminjaman`.`buku_id`